Feature: Жилин. Тестирование страницы содержащей доску с задачами

#Укажем имя сценария (в одной фиче может быть несколько)
Scenario: Проверка всех тестов

#И используем наши шаги.
  Given я запускаю тест 002
  Given я запускаю тест 003
  Given я запускаю тест 004
  Given я запускаю тест 005
#  Given я запускаю тест 006
#  Given я запускаю тест 007
#  Given я запускаю тест 008
#  Given я запускаю тест 011
#  Given я запускаю тест 012
#  Given я запускаю тест 013
#  Given я запускаю тест 014
#  Given я запускаю тест 015



  # Ищу все заголовки до теста и создаю список
  # Ищу все задачи до теста и создаю список

  # Придумываю новый заголовок "название нового заголовка"
  # Кликаю на кнопку "Создать новое задание"
  # Кликаю на выпадающий список
  # Выбираю выпадающий список
  # Нахожу в выпавшем списке пункт соответствующий тексту "Создать новый список"
  # Кликаю на контейнер, чтобы выйти
  # Кликаю на поле "Заголовок"
  # Вставляю текст в поле "название нового заголовка"
  # Кликаю на поле "Новая задача"
  # Вставляю в поле текст "Задача №1 Т002.py"
  # Кликаю на кнопку ОК

  # Ищу все заголовки после теста
  # Ищу все задачи после теста